choreboy17240/Smart-Charger-Software/lib/STM32_4kOLED/src/STM32_4kOLED.cpp
/**
 * @file STM32_4kOLED.cpp 
 * @brief SSD1306 OLED Text Display Library for Arduino
 *
 * Based on ssd1306xled, re-written and extended by Stephen Denne
 * from 2017-04-25 at https://github.com/datacute/Tiny4kOLED
 *
 */

// ----------------------------------------------------------------------------

#include "STM32_4kOLED_common.h"
#include "STM32_4kOLED_Wire.h"

#define SSD1306_COLUMNS 128										///< Default display width in pixels
#define SSD1306_PAGES 4												///< Default display height in pages

#define SSD1306_COMMAND 0x00									///< Command byte
#define SSD1306_DATA 0x40											///< Data byte

// ----------------------------------------------------------------------------

static uint8_t oledOffsetX = 0;								// OLED offset in pixels
static uint8_t oledOffsetY = 0; 							// OLED Offset in pages??

static uint8_t oledWidth = SSD1306_COLUMNS;		// OLED display width in pixels
static uint8_t oledPages = SSD1306_PAGES;			// OLED display height in pages

static const DCUnicodeFont *oledUnicodeFont = 0;
static uint8_t unicodeFontNum = 0;
static const DCfont *oledFont = 0;

static uint8_t oledX = 0;											// Horizontal cursor position in pixels
static uint8_t oledY = 0;											// Vertical cursor position in pages

static uint8_t renderingFrame = 0xB0;					// Default = 0xB0
static uint8_t drawingFrame = 0x40;						// Default = 0x40

static uint8_t doubleSize = 0;								// Double size text? (0=No, 1=Yes)
static uint8_t characterSpacing = 0;					// Text character width (0=proportional font)
static DCUnicodeCodepoint unicodeCodepoint = { 0 };
static uint8_t utf8Continuation = 0;

static void (*wireBeginFn)(void);
static bool (*wireBeginTransmissionFn)(void);
static bool (*wireWriteFn)(uint8_t byte);
static uint8_t (*wireEndTransmissionFn)(void);

static void (SSD1306Device::* decodeFn)(uint8_t c) = 0;
static void (SSD1306Device::* renderFn)(uint8_t c) = 0;
static uint8_t (*combineFn)(uint8_t x, uint8_t y, uint8_t b) = 0;
static uint8_t writesSinceSetCursor = 0;

static void ssd1306_begin(void) {
	wireBeginFn();
}

static void ssd1306_send_start(void) {
	wireBeginTransmissionFn();
}

static bool ssd1306_send_byte(uint8_t byte) {
	return wireWriteFn(byte);
}

static void ssd1306_send_stop(void) {
	wireEndTransmissionFn();
}

static void ssd1306_send_command_start(void) {
	ssd1306_send_start();
	ssd1306_send_byte(SSD1306_COMMAND);
}

static void ssd1306_send_data_start(void) {
	ssd1306_send_start();
	ssd1306_send_byte(SSD1306_DATA);
}

static void ssd1306_send_command_byte(uint8_t byte) {
	if (ssd1306_send_byte(byte) == 0) {
		ssd1306_send_stop();
		ssd1306_send_command_start();
		ssd1306_send_byte(byte);
	}
}

static void ssd1306_send_data_byte(uint8_t byte) {
	if (combineFn) byte = (*combineFn)(oledX + writesSinceSetCursor, oledY, byte);
	if (ssd1306_send_byte(byte) == 0) {
		ssd1306_send_stop();
		ssd1306_send_data_start();
		ssd1306_send_byte(byte);
	}
	writesSinceSetCursor++;
}

static void ssd1306_send_command(uint8_t command) {
	ssd1306_send_command_start();
	ssd1306_send_byte(command);
	ssd1306_send_stop();
}

static void ssd1306_send_command2(uint8_t command1, uint8_t command2) {
	ssd1306_send_command_start();
	ssd1306_send_byte(command1);
	ssd1306_send_byte(command2);
	ssd1306_send_stop();
}

static void ssd1306_send_command3(uint8_t command1, uint8_t command2, uint8_t command3) {
	ssd1306_send_command_start();
	ssd1306_send_byte(command1);
	ssd1306_send_byte(command2);
	ssd1306_send_byte(command3);
	ssd1306_send_stop();
}

static void ssd1306_send_command6(uint8_t command1, uint8_t command2, uint8_t command3, uint8_t command4, uint8_t command5, uint8_t command6) {
	ssd1306_send_command_start();
	ssd1306_send_byte(command1);
	ssd1306_send_byte(command2);
	ssd1306_send_byte(command3);
	ssd1306_send_byte(command4);
	ssd1306_send_byte(command5);
	ssd1306_send_byte(command6);
	ssd1306_send_stop();
}

static void ssd1306_send_command7(uint8_t command1, uint8_t command2, uint8_t command3, uint8_t command4, uint8_t command5, uint8_t command6, uint8_t command7) {
	ssd1306_send_command_start();
	ssd1306_send_byte(command1);
	ssd1306_send_byte(command2);
	ssd1306_send_byte(command3);
	ssd1306_send_byte(command4);
	ssd1306_send_byte(command5);
	ssd1306_send_byte(command6);
	ssd1306_send_byte(command7);
	ssd1306_send_stop();
}

static uint8_t invertByte(uint8_t x, uint8_t y, uint8_t byte) {
	return byte ^ 0xff;
}

// Default constructor (uses Wire library)
SSD1306Device::SSD1306Device(void) {
	wireBeginFn = &tiny4koled_begin_wire;
	wireBeginTransmissionFn = &tiny4koled_beginTransmission_wire;
	wireWriteFn = &datacute_write_wire;
	wireEndTransmissionFn = &datacute_endTransmission_wire;
}

// Constructor with initialization to allow for alternative I2C libraries
SSD1306Device::SSD1306Device(void (*wireBeginFunc)(void), bool (*wireBeginTransmissionFunc)(void), bool (*wireWriteFunc)(uint8_t byte), uint8_t (*wireEndTransmissionFunc)(void)) {
	wireBeginFn = wireBeginFunc;
	wireBeginTransmissionFn = wireBeginTransmissionFunc;
	wireWriteFn = wireWriteFunc;
	wireEndTransmissionFn = wireEndTransmissionFunc;
}

void SSD1306Device::begin(void) {
	begin(sizeof(tiny4koled_init_128x32r), tiny4koled_init_128x32r);
}

void SSD1306Device::begin(uint8_t init_sequence_length, const uint8_t init_sequence []) {
	ssd1306_begin();

	ssd1306_send_command_start();
	for (uint8_t i = 0; i < init_sequence_length; i++) {
		ssd1306_send_command_byte(pgm_read_byte(&init_sequence[i]));
	}
	ssd1306_send_stop();
}

void SSD1306Device::begin(uint8_t width, uint8_t height, uint8_t init_sequence_length, const uint8_t init_sequence []) {
	oledOffsetX = (128 - width) >> 1;
	oledOffsetY = 0;
	oledWidth = width;
	oledPages = height >> 3;
	begin(init_sequence_length,init_sequence);
}

void SSD1306Device::begin(uint8_t xOffset, uint8_t yOffset, uint8_t width, uint8_t height, uint8_t init_sequence_length, const uint8_t init_sequence []) {
	oledOffsetX = xOffset;
	oledOffsetY = yOffset >> 3;
	oledWidth = width;
	oledPages = height >> 3;
	begin(init_sequence_length,init_sequence);
}

void SSD1306Device::setPages(uint8_t pages) {
	oledPages = pages;
}

void SSD1306Device::setWidth(uint8_t width) {
	oledWidth = width;
}

void SSD1306Device::setHeight(uint8_t height) {
	oledPages = height >> 3;
}

void SSD1306Device::setOffset(uint8_t xOffset, uint8_t yOffset) {
	oledOffsetX = xOffset;
	oledOffsetY = yOffset >> 3;
}

void SSD1306Device::setRotation(uint8_t rotation) {
	uint8_t rotationBit = (rotation & 0x01);
	ssd1306_send_command2(0xC0 | (rotationBit << 3), 0xA0 | rotationBit);
}

void SSD1306Device::setFont(const DCfont *font) {
	setFontOnly(font);
	decodeFn = &SSD1306Device::decodeAsciiInternal;
	renderFn = &SSD1306Device::renderOriginalSize;
	doubleSize = 0;
}

void SSD1306Device::setUnicodeFont(const DCUnicodeFont *unicode_font) {
	oledUnicodeFont = unicode_font;
	unicodeFontNum = 0;
	setFontOnly(oledUnicodeFont->fonts[unicodeFontNum].font);
	decodeFn = &SSD1306Device::decodeUtf8Internal;
	renderFn = &SSD1306Device::renderOriginalSize;
	doubleSize = 0;
}

void SSD1306Device::setFontX2(const DCfont *font) {
	setFontOnly(font);
	decodeFn = &SSD1306Device::decodeAsciiInternal;
	renderFn = &SSD1306Device::renderDoubleSize;
	doubleSize = 1;
}

