choreboy17240/Smart-Charger-Software/lib/STM32_4kOLED/src/STM32_4kOLED.cpp
void SSD1306Device::setUnicodeFontX2(const DCUnicodeFont *unicode_font) {
	oledUnicodeFont = unicode_font;
	unicodeFontNum = 0;
	setFontOnly(oledUnicodeFont->fonts[unicodeFontNum].font);
	decodeFn = &SSD1306Device::decodeUtf8Internal;
	renderFn = &SSD1306Device::renderDoubleSize;
	doubleSize = 1;
}

void SSD1306Device::setFontX2Smooth(const DCfont *font) {
	setFontOnly(font);
	decodeFn = &SSD1306Device::decodeAsciiInternal;
	renderFn = &SSD1306Device::renderDoubleSizeSmooth;
	doubleSize = 1;
}

void SSD1306Device::setUnicodeFontX2Smooth(const DCUnicodeFont *unicode_font) {
	oledUnicodeFont = unicode_font;
	unicodeFontNum = 0;
	setFontOnly(oledUnicodeFont->fonts[unicodeFontNum].font);
	decodeFn = &SSD1306Device::decodeUtf8Internal;
	renderFn = &SSD1306Device::renderDoubleSizeSmooth;
	doubleSize = 1;
}

/**
 *  @brief Set font to be used for generating text
 *  @param font: Pointer to font data structure
 */
void SSD1306Device::setFontOnly(const DCfont *font) {
	oledFont = font;
	if (font->width == 0)
		// Fixed font
		characterSpacing = font->spacing;
	else
		// Proportional font
		characterSpacing = 0;
}

/**
 *  @brief Set character spacing
 * 	@param spacing: Text character width (0=proportional font)
 */
void SSD1306Device::setSpacing(uint8_t spacing) {
	characterSpacing = spacing;
}

void SSD1306Device::setCombineFunction(uint8_t (*combineFunc)(uint8_t, uint8_t, uint8_t)) {
	combineFn = combineFunc;
}

uint16_t SSD1306Device::getCharacterDataOffset(uint8_t c) {
	uint16_t c_index = (uint16_t)c - oledFont->first;
	if (c_index == 0) return 0;

	uint8_t w = oledFont->width;
	uint8_t h = oledFont->height;

	if (w > 0) return c_index * w * h;

	uint16_t offset = 0;
	uint16_t c_index16s = c_index >> 4;
	for (uint16_t pre_c = 0; pre_c < c_index16s; pre_c++)
	{
		uint16_t w16 = pgm_read_word(&(oledFont->widths16s[pre_c]));
		offset += w16;
	}
	for (uint16_t pre_c = c_index16s << 4; pre_c < c_index; pre_c++)
	{
		w = pgm_read_byte(&(oledFont->widths[pre_c]));
		offset += w;
	}
	return offset * h;
}

/**
 *  @brief Get the width in pixels for the specified character
 *  @param c: Character
 *  @returns Width in pixels
 *  @note For fixed fonts, returns the generic width in pixels.
 *        For proportional fonts, it returns the specific width
 *        for the given character.
 */
uint8_t SSD1306Device::getCharacterWidth(uint8_t c) {
	uint8_t w = oledFont->width;
	if (w == 0) {
		uint16_t c_index = (uint16_t)c - oledFont->first;
		w = pgm_read_byte(&(oledFont->widths[c_index]));
	}
	return w;
}

/**
 *  @brief Get the total width in pixels for the specified string with the current font.
 *  @param text: String to be analyzed
 *  @returns Total width in pixels
 */
uint16_t SSD1306Device::getTextWidth(DATACUTE_F_MACRO_T *text) {
	PGM_P p = reinterpret_cast<PGM_P>(text);
	uint16_t totalWidth = 0;

	while (true) {
		unsigned char c = pgm_read_byte(p++);
		if (c == 0) break;
		totalWidth += getCharacterWidth(c);
		totalWidth += characterSpacing; // every character ends with whitespace
	}

	return totalWidth;
}

/**
 * @brief Sets cursor position within the active rendering frame
 * @param x: Column number (0-127)
 * @param y: Page number (0-7)
 * @note X and Y offsets are added to the requested cursor position.
 */
void SSD1306Device::setCursor(uint8_t x, uint8_t y) {
	/*
	 *  Command sequence:
	 *  1. Set GDDRAM page start address (0-7)
	 *  2. Set higher column nibble start address
	 *  3. Set lower column nibble start address
	 */
	ssd1306_send_command3(renderingFrame | ((y + oledOffsetY) & 0x07), 0x10 | (((x + oledOffsetX) & 0xf0) >> 4), (x + oledOffsetX) & 0x0f);
	oledX = x;
	oledY = y;
	writesSinceSetCursor = 0;
}

/**
 *  @brief Get the current horizontal "cursor" position in pixels.
 *  @returns Horizontal position in pixels
 */
uint8_t SSD1306Device::getCursorX() {
	return oledX;
}

/**
 *  @brief Get the current vertical "cursor" position in pages (8 pixels).
 *  @returns Vertical position in pages
 */
uint8_t SSD1306Device::getCursorY() {
	return oledY;
}

/**
 *  @brief Clear the OLED screen buffer to black
 *  @returns With double-buffering, this only affects the screen buffer 
 *           that we're actively writing to, not the screen buffer
 *           being displayed.
 */
void SSD1306Device::clear(void) {
	fill(0x00);
}

/**
 *  @brief Fill the OLED screen buffer with a bit pattern.
 *  @param Fill pattern to be written to the screen buffer.
 *  @returns With double-buffering, this only affects the screen buffer 
 *           that we're actively writing to, not the screen buffer
 *           being displayed.
 */
void SSD1306Device::fill(uint8_t fill) {
	for (uint8_t m = 0; m < oledPages; m++) {
		setCursor(0, m);
		fillToEOP(fill);
	}
	setCursor(0, 0);
}

void SSD1306Device::newLine(uint8_t fontHeight) {
	uint8_t h = fontHeight << doubleSize;
	oledY+=h;
	if (oledY > oledPages - h) {
		oledY = oledPages - h;
	}
	setCursor(0, oledY);
}

void SSD1306Device::newLine(void) {
	newLine(oledFont->height);
}

size_t SSD1306Device::write(byte c) {
	if (decodeFn) (this->*decodeFn)(c);
	return 1;
}

void SSD1306Device::decodeAsciiInternal(uint8_t c) {
	if (c == '\r')
		return;

	if (c == '\n') {
		newLine(oledFont->height);
		return;
	}

	if (oledFont->first <= c &&
	    oledFont->last >= c)
  	(this->*renderFn)(c);
}

void SSD1306Device::renderOriginalSize(uint8_t c) {
	uint8_t w = getCharacterWidth(c);
	uint8_t h = oledFont->height;
	uint8_t spacing = characterSpacing;

	if (oledX > ((uint8_t)oledWidth - w)) {
		newLine(h);
	}

	if (oledX + w + spacing > (uint8_t)oledWidth) {
		spacing = 0;
	}

	uint16_t offset = getCharacterDataOffset(c);
	uint8_t line = h;
	do
	{
		ssd1306_send_data_start();
		for (uint8_t i = 0; i < w; i++) {
			ssd1306_send_data_byte(pgm_read_byte(&(oledFont->bitmap[offset++])));
		}
		repeatData(0, spacing);
		ssd1306_send_stop();
		if (line > 1) {
			setCursor(oledX, oledY + 1);
		}
		else {
			setCursor(oledX + w + spacing, oledY - (h - 1));
		}
	}
	while (--line);
}

uint8_t SSD1306Device::getExpectedUtf8Bytes(void) {
	return utf8Continuation;
}

void SSD1306Device::RenderUnicodeSpace(void) {
	uint8_t spaceWidth = (oledUnicodeFont->space_width + characterSpacing) << doubleSize;
	if (oledX > ((uint8_t)oledWidth - spaceWidth)) {
		newLine(oledFont->height);
	} else {
		uint8_t textHeight = oledFont->height << doubleSize;
		uint8_t line = textHeight;
		do
		{
			ssd1306_send_data_start();
			repeatData(0, spaceWidth);
			ssd1306_send_stop();
			if (line > 1) {
				setCursor(oledX, oledY + 1);
			}
			else {
				setCursor(oledX + spaceWidth, oledY - (textHeight - 1));
			}
		}
		while (--line);
	}
}

