choreboy17240/Smart-Charger-Software/lib/STM32_4kOLED/src/STM32_4kOLED.cpp
bool SSD1306Device::SelectUnicodeBlock(void) {
	if (oledUnicodeFont->fonts[unicodeFontNum].unicode_block == unicodeCodepoint.unicode.block && 
	    oledUnicodeFont->fonts[unicodeFontNum].unicode_plane == unicodeCodepoint.unicode.plane &&
	    oledUnicodeFont->fonts[unicodeFontNum].font->first <= unicodeCodepoint.unicode.offset &&
	    oledUnicodeFont->fonts[unicodeFontNum].font->last >= unicodeCodepoint.unicode.offset) return true;
	uint8_t fontNum = unicodeFontNum + 1;
	if (fontNum == oledUnicodeFont->num_fonts) fontNum = 0;
	while(fontNum != unicodeFontNum) {
		if (oledUnicodeFont->fonts[fontNum].unicode_block == unicodeCodepoint.unicode.block && 
		    oledUnicodeFont->fonts[fontNum].unicode_plane == unicodeCodepoint.unicode.plane &&
		    oledUnicodeFont->fonts[fontNum].font->first <= unicodeCodepoint.unicode.offset &&
		    oledUnicodeFont->fonts[fontNum].font->last >= unicodeCodepoint.unicode.offset) {
			unicodeFontNum = fontNum;
			setFontOnly(oledUnicodeFont->fonts[unicodeFontNum].font);
			return true;
		}
		if (fontNum++ == oledUnicodeFont->num_fonts) fontNum = 0;
	}
	return false;
}

void SSD1306Device::decodeUtf8Internal(uint8_t utf8byte) {
	if ((utf8byte & 0x80) == 0x00) { // U+0000 to U+007F (most common?)
		unicodeCodepoint.codepoint = utf8byte;
		utf8Continuation = 0;
	}
	else if ((utf8byte & 0xC0) == 0x80) { // continuation byte (second most common?)
		unicodeCodepoint.codepoint = (unicodeCodepoint.codepoint << 6) | (utf8byte & 0x3F);
		utf8Continuation--;
	}
	else if ((utf8byte & 0xE0) == 0xC0) { // U+0080 to U+07FF (third most common?)
		unicodeCodepoint.codepoint = utf8byte & 0x1F;
		utf8Continuation = 1;
	}
	else if ((utf8byte & 0xF0) == 0xE0) { // U+0800 to U+FFFF
		unicodeCodepoint.codepoint = utf8byte & 0x0F;
		utf8Continuation = 2;
	}
	else if ((utf8byte & 0xF8) == 0xF0) { // U+10000 to U+10FFFF
		unicodeCodepoint.codepoint = utf8byte & 0x07;
		utf8Continuation = 3;
	}

	if (utf8Continuation != 0) return;

	uint32_t c = unicodeCodepoint.codepoint;

	// Don't switch blocks for control characters, nor space

	if (c == '\n') {
		newLine(oledFont->height);
		return;
	}

	if (c < ' ') return;

	if (c == ' ') {
		RenderUnicodeSpace();
		return;
	}

	// If none of the fonts support the current unicode block, don't output anything.
	if (SelectUnicodeBlock()) {
		(this->*renderFn)(unicodeCodepoint.unicode.offset);
	}
}

static uint16_t ReadCharacterBits(uint8_t * cPtr, uint8_t w) {
  uint16_t resultBits = pgm_read_byte(cPtr);
  if (oledFont->height > 1) {
    // change type before shifting, as otherwise signed ints will be used.
    resultBits |= (uint16_t)pgm_read_byte(cPtr + w) << 8;
  }
  return resultBits;
}

static uint32_t Stretch(uint16_t x) {
  uint32_t x32 = (uint32_t)x;
  x32 = (x32<<8 | x32) & 0x00FF00FF;
  x32 = (x32<<4 | x32) & 0x0F0F0F0F;        // 0000abcd____efgh -> 0000abcd0000efgh
  x32 = (x32<<2 | x32) & 0x33333333;        // 00ab__cd00ef__gh -> 00ab00cd00ef00gh
  x32 = (x32<<1 | x32) & 0x55555555;        // 0a_b0c_d0e_f0g_h -> 0a0b0c0d0e0f0g0h
  return x32 | x32<<1;                      // aabbccddeeffgghh
}

void SSD1306Device::sendDoubleBits(uint32_t doubleBits) {
  ssd1306_send_data_byte(doubleBits);
  ssd1306_send_data_byte(doubleBits>>8);
  if (oledFont->height > 1) {
    ssd1306_send_data_byte(doubleBits>>16);
    ssd1306_send_data_byte(doubleBits>>24);
  }
}

void SSD1306Device::renderDoubleSize(uint8_t c) {
	uint16_t offset = getCharacterDataOffset(c);
	uint8_t w = getCharacterWidth(c);
	uint8_t h = oledFont->height;

	// change memory mode to advance pages, before columns
	setMemoryAddressingMode(1);
	uint8_t topPage = oledY + (renderingFrame & 0x04);
	setPageAddress(topPage, topPage + h + h - 1);

	ssd1306_send_data_start();
	uint8_t * cPtr = &(oledFont->bitmap[offset]);
	for (uint8_t col = 0 ; col < w; col++) {
		uint16_t col0 = ReadCharacterBits(cPtr + col, w);
		uint32_t col0L = Stretch(col0);
		sendDoubleBits(col0L);
		sendDoubleBits(col0L);
	}
	ssd1306_send_stop();

	setMemoryAddressingMode(2);
	setPageAddress(0,7);

	setCursor(oledX + (w + characterSpacing) * 2 , oledY);
}

void SSD1306Device::renderDoubleSizeSmooth(uint8_t c) {
	uint16_t offset = getCharacterDataOffset(c);
	uint8_t w = getCharacterWidth(c);
	uint8_t h = oledFont->height;

	// change memory mode to advance pages, before columns
	setMemoryAddressingMode(1);
	uint8_t topPage = oledY + (renderingFrame & 0x04);
	setPageAddress(topPage, topPage + h + h - 1);

	ssd1306_send_data_start();

	uint8_t * cPtr = &(oledFont->bitmap[offset]);
	uint16_t col0 = ReadCharacterBits(cPtr, w);
	uint32_t col0L, col0R, col1L, col1R;
	col0L = Stretch(col0);
	col0R = col0L;
	for (uint8_t col = 1 ; col < w; col++) {
		uint16_t col1 = ReadCharacterBits(cPtr + col, w);
		col1L = Stretch(col1);
		col1R = col1L;
		for (uint8_t i=0; i<16; i++) { // (15 pairs of bits in 8 bit line)
			for (uint8_t j=1; j<3; j++) {
				if (((col0>>i & 0b11) == (uint8_t)(3-j)) && ((col1>>i & 0b11) == j)) {
					col0R |= (uint32_t)1<<((i*2)+j);
					col1L |= (uint32_t)1<<((i*2)+3-j);
				}
			}
		}
		sendDoubleBits(col0L);
		sendDoubleBits(col0R);
		col0L = col1L; col0R = col1R; col0 = col1;
	}
	sendDoubleBits(col0L);
	sendDoubleBits(col0R);
	ssd1306_send_stop();
	setMemoryAddressingMode(2);
	setPageAddress(0,7);
	setCursor(oledX + (w + characterSpacing) * 2 , oledY);
}

void SSD1306Device::bitmap(uint8_t x0, uint8_t y0, uint8_t x1, uint8_t y1, const uint8_t bitmap[]) {
	uint16_t j = 0;

 	for (uint8_t y = y0; y < y1; y++) {
		setCursor(x0,y);
		ssd1306_send_data_start();
		for (uint8_t x = x0; x < x1; x++) {
			ssd1306_send_data_byte(pgm_read_byte(&bitmap[j++]));
		}
		ssd1306_send_stop();
	}

	setCursor(0, 0);
}

void SSD1306Device::clearToEOL(void) {
	fillToEOL(0x00);
}

void SSD1306Device::fillToEOL(uint8_t fill) {
	uint8_t x = oledX;
	uint8_t pagesToClear = oledFont->height << doubleSize;
	do
	{
		fillToEOP(fill);
		if (pagesToClear > 1) {
			setCursor(x,oledY + 1);
		}
	}
	while (--pagesToClear);
}

void SSD1306Device::clearToEOP(void) {
	fillToEOP(0x00);
}

