choreboy17240/Smart-Charger-Software/lib/STM32_4kOLED/src/STM32_4kOLED.cpp
void SSD1306Device::fillToEOP(uint8_t fill) {
	fillLength(fill, oledWidth - oledX);
}

void SSD1306Device::fillLength(uint8_t fill, uint8_t length) {
	if (length == 0) return;
	oledX += length;
	ssd1306_send_data_start();
	repeatData(fill, length);
	ssd1306_send_stop();
}

void SSD1306Device::startData(void) {
	ssd1306_send_data_start();
}

void SSD1306Device::sendData(const uint8_t data) {
	ssd1306_send_data_byte(data);
}

void SSD1306Device::repeatData(uint8_t data, uint8_t length) {
	for (uint8_t x = 0; x < length; x++) {
		ssd1306_send_data_byte(data);
	}
}

void SSD1306Device::clearData(uint8_t length) {
	repeatData(0, length);
}

void SSD1306Device::endData(void) {
	ssd1306_send_stop();
}

void SSD1306Device::invertOutput(bool enable) {
	combineFn = enable ? &invertByte : NULL;
}	

void SSD1306Device::clipText(uint16_t startPixel, uint8_t width, DATACUTE_F_MACRO_T *text) {
	uint8_t h = oledFont->height;
	uint8_t w = oledFont->width;
	PGM_P p = reinterpret_cast<PGM_P>(text);
	uint8_t drawnColumns = 0;
	// It is currently up to the caller to make sure that the startPixel is still within the text.
	// This method needs to change to read each character in the string up to startPixel, to check for end of string
	// If beyond the end of the string, write 0s/spaces
	// However, it probably takes less bytes currently to simply put spaces at the beginning or end of the text.
	uint16_t charactersToSkip = startPixel / w;
	uint8_t initialSkip = startPixel % w;
	p += charactersToSkip;
	while (drawnColumns < width) {
		unsigned char c = pgm_read_byte(p++);
		if (c == 0) break;
		uint16_t offset = ((uint16_t)c - oledFont->first) * w * h;
		uint8_t line = h;
		do
		{
			offset += initialSkip;
			ssd1306_send_data_start();
			for (uint8_t i = 0; (i < w - initialSkip) && ((drawnColumns + i) < width); i++) {
				ssd1306_send_data_byte(pgm_read_byte(&(oledFont->bitmap[offset + i])));
			}
			offset += w - initialSkip;
			ssd1306_send_stop();
			if (h > 1) {
				if (line > 1) {
					setCursor(oledX, oledY + 1);
				}
				else {
					setCursor(oledX + w, oledY - (h - 1));
				}
			}
		} while (--line);
		drawnColumns += w - initialSkip;
		initialSkip = 0;
	}
}

void SSD1306Device::clipTextP(uint16_t startPixel, uint8_t width, DATACUTE_F_MACRO_T *text) {
	uint8_t h = oledFont->height;
	PGM_P p = reinterpret_cast<PGM_P>(text);
	uint8_t drawnColumns = 0;
	// It is currently up to the caller to make sure that the startPixel is still within the text.
	// This method needs to change to read each character in the string up to startPixel, to check for end of string
	// If beyond the end of the string, write 0s/spaces
	// However, it probably takes less bytes currently to simply put spaces at the beginning or end of the text.
	uint16_t initialSkip = startPixel;
	while (drawnColumns < width) {
		unsigned char c = pgm_read_byte(p++);
		if (c == 0) break;

		uint8_t spacing = characterSpacing;
		uint8_t w = getCharacterWidth(c);

		// start drawing after character and inter-character spacing?
		if (initialSkip >= w + spacing) {
			initialSkip -= w + spacing;
			// Need to read the next character
			continue;
		}

		// do we just need to draw spacing?
		if (initialSkip >= w) {
			initialSkip -= w;
			//if (spacing > initialSkip) {
				spacing -= initialSkip;
			//}
			if (drawnColumns + spacing > width) {
				spacing = width - drawnColumns;
			}
			//if (spacing > 0) {
				uint8_t line = h;
				do
				{
					ssd1306_send_data_start();
					repeatData(0, spacing);
					ssd1306_send_stop();
					if (h > 1) {
						if (line > 1) {
							setCursor(oledX, oledY + 1);
						}
						else {
							setCursor(oledX + spacing, oledY - (h - 1));
						}
					}
				} while (--line);
				drawnColumns += spacing;
			//}
			initialSkip = 0;
			continue;
		}

		// need to only put spacing on the end, if there is enough room
		uint8_t endOfCharacter = drawnColumns + w - initialSkip;
		if (endOfCharacter > width) {
			spacing = 0;
		} else {
			if (endOfCharacter + spacing > width) {
				spacing = width - endOfCharacter;
			}
		}

		uint16_t offset = getCharacterDataOffset(c);
		uint8_t line = h;
		do
		{
			offset += initialSkip;
			ssd1306_send_data_start();
			for (uint8_t i = 0; (i < w - initialSkip) && ((drawnColumns + i) < width); i++) {
				ssd1306_send_data_byte(pgm_read_byte(&(oledFont->bitmap[offset + i])));
			}
			repeatData(0, spacing);
			ssd1306_send_stop();
			offset += w - initialSkip;
			if (h > 1) {
				if (line > 1) {
					setCursor(oledX, oledY + 1);
				}
				else {
					setCursor(oledX + w + spacing, oledY - (h - 1));
				}
			}
		} while (--line);
		drawnColumns += w - initialSkip + spacing;
		initialSkip = 0;
	}
}

// Double Buffering Commands

/**
 *  @brief Switch the screen buffer currently being rendered to.
 *  @note Sets the RAM page start address to point to either
 *        the upper (0x00) or lower (0x04) bank of the
 *        controller's display RAM.  Subsequent commands
 * 				will target this RAM buffer.
 */
void SSD1306Device::switchRenderFrame(void) {
	// Set GDDRAM page start address to either
	// 0x00 or 0x04 to select the upper or lower
	// bank of display RAM
	renderingFrame ^= 0x04;
}

/**
 *  @brief Switch the screen buffer currently being displayed.
 *  @note Sets the display start line to either 0x00 or 0x02
 *        to select upper or lower bank of the display RAM.
 */
void SSD1306Device::switchDisplayFrame(void) {
	drawingFrame ^= 0x20;
	// Set display start line to either 0x00 or 0x02
	// to select upper or lower bank of display RAM
	ssd1306_send_command(drawingFrame);
}

/**
 *  @brief Switch BOTH the rendering and display screen buffers.
 */
void SSD1306Device::switchFrame(void) {
	switchDisplayFrame();
	switchRenderFrame();
}

uint8_t SSD1306Device::currentRenderFrame(void) {
	return (renderingFrame >> 2) & 0x01;
}

uint8_t SSD1306Device::currentDisplayFrame(void) {
	return (drawingFrame >> 5) & 0x01;
}

// 1. Fundamental Command Table

void SSD1306Device::setContrast(uint8_t contrast) {
	ssd1306_send_command2(0x81,contrast);
}

void SSD1306Device::setEntireDisplayOn(bool enable) {
	if (enable)
		ssd1306_send_command(0xA5);
	else
		ssd1306_send_command(0xA4);
}

void SSD1306Device::setInverse(bool enable) {
	if (enable)
		ssd1306_send_command(0xA7);
	else
		ssd1306_send_command(0xA6);
}

void SSD1306Device::setExternalIref(void) {
	ssd1306_send_command2(0xAD, 0x00);
}

void SSD1306Device::setInternalIref(bool bright) {
	ssd1306_send_command2(0xAD, ((bright & 0x01) << 5) | 0x10);
}

void SSD1306Device::off(void) {
	ssd1306_send_command(0xAE);
}

void SSD1306Device::on(void) {
	ssd1306_send_command(0xAF);
}

// 2. Scrolling Command Table

void SSD1306Device::scrollRight(uint8_t startPage, uint8_t interval, uint8_t endPage, uint8_t startColumn, uint8_t endColumn) {
	ssd1306_send_command7(0x26, 0x00, startPage + oledOffsetY, interval, endPage + oledOffsetY, startColumn, endColumn);
}

void SSD1306Device::scrollLeft(uint8_t startPage, uint8_t interval, uint8_t endPage, uint8_t startColumn, uint8_t endColumn) {
	ssd1306_send_command7(0x27, 0x00, startPage + oledOffsetY, interval, endPage + oledOffsetY, startColumn, endColumn);
}

void SSD1306Device::scrollRightOffset(uint8_t startPage, uint8_t interval, uint8_t endPage, uint8_t offset) {
	ssd1306_send_command6(0x29, 0x00, startPage + oledOffsetY, interval, endPage + oledOffsetY, offset);
}

void SSD1306Device::scrollLeftOffset(uint8_t startPage, uint8_t interval, uint8_t endPage, uint8_t offset) {
	ssd1306_send_command6(0x2A, 0x00, startPage + oledOffsetY, interval, endPage + oledOffsetY, offset);
}

void SSD1306Device::scrollContentRight(uint8_t startPage, uint8_t endPage, uint8_t startColumn, uint8_t endColumn) {
	ssd1306_send_command7(0x2C, 0x00, startPage + oledOffsetY, 0x01, endPage + oledOffsetY, startColumn + oledOffsetX, endColumn + oledOffsetX);
}

void SSD1306Device::scrollContentLeft(uint8_t startPage, uint8_t endPage, uint8_t startColumn, uint8_t endColumn) {
	ssd1306_send_command7(0x2D, 0x00, startPage + oledOffsetY, 0x01, endPage + oledOffsetY, startColumn + oledOffsetX, endColumn + oledOffsetX);
}

void SSD1306Device::deactivateScroll(void) {
	ssd1306_send_command(0x2E);
}

void SSD1306Device::activateScroll(void) {
	ssd1306_send_command(0x2F);
}

